app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "Mr Johnnes"]]
---
  def similar
    id = params[:id]
    @movie = Movie.find(id)
    if (@movie.director.length == 0)